/*1. Легенда розповідає, що десь у Ханої є храм, у якому розташована така конструкція: 
на основі укріплені 3 алмазні стрижні, на які при створенні світу 
Брахма нанизав 64 золотих диска з отвором посередині, 
причому внизу виявився найбільший диск, на ньому — трохи менший і так далі, 
поки на верхівці піраміди не виявився найменший диск. 
Жерці храму зобов'язані перекладати диски за такими правилами:
■ За один хід можна перенести тільки один диск.
■ Не можна класти більший диск на менший.
Керуючись цими нехитрими правилами, жерці мають перенести вихідну піраміду 
з 1-го стрижня на 3-й. Щойно вони впораються з цим завданням, настане кінець світу.
Ми пропонуємо вам як домашнє завдання розв'язати цю задачу за допомогою рекурсії.
2. Написати рекурсивну функцію знаходження ступеня числа.
3. Написати рекурсивну функцію, яка виводить N зірок у ряд, число N задає користувач. 
Проілюструйте роботу функції прикладом.
4. Написати рекурсивну функцію, яка обчислює суму всіх чисел у діапазоні від a до b. 
Користувач вводить a і b. Проілюструйте роботу функції прикладом.
5. Напишіть рекурсивну функцію, яка приймає одновимірний масив зі 100 цілих чисел, 
заповнених випадковим чином, і знаходить позицію, з якої починається 
послідовність з 10 чисел, сума яких мінімальна.*/

#include<iostream>
#include<stdlib.h>
#include<time.h>
#include "Zagalne.h"
using namespace std;

int main() {
	int a = 0;
	while (a != 6) {
		Vubir_zadachi();
		Vvod(a);
		Swich(a);
		Show('\n');
	}
}