/*1. Дан одновимірний масив цілих чисел. Напишіть рекурсивну функцію, яка здійснює знаходження
шуканого значення за допомогою бінарного пошуку. Функція повертає позицію входження шуканого значення.
Проілюструйте роботу функції прикладом.

2.
a) Напишіть рекурсивну функцію, яка приймає двовимірний масив цілих чисел і 
кількість зрушень і виконує круговий зсув масиву вправо.
Наприклад:
Дан масив:
4 5 6 7
1 2 4 1
4 5 6 9
Зрушуємо на три вправо:
5 6 7 4
2 4 1 1
5 6 9 4

b) Напишіть рекурсивну функцію, яка приймає двовимірний масив цілих чисел і 
кількість зрушень і виконує круговий зсув масиву вліво.
Наприклад
Дан масив:
4 5 6 7
1 2 4 1
4 5 6 9
Зрушуємо на два вліво:
6 7 4 5
4 1 1 2
6 9 4 5

c) Напишіть рекурсивну функцію, яка приймає двовимірний масив цілих чисел і 
кількість зрушень і виконує круговий зсув масиву вниз.
Наприклад:
Дан масив:
4 5 6 7
1 2 4 1
4 3 6 8
Зрушуємо вниз на один:
4 3 6 8
4 5 6 7
1 2 4 1

3. Дана шахівниця розміром 8х8 і шаховий кінь. 
Програма має вимагати від користувача координати клітини поля й поставити туди коня. 
Завдання програми знайти і вивести шлях коня, при якому він обійде всі клітини дошки, 
стаючи в кожну клітину тільки один раз.
(Оскільки процес пошуку шляху для різних початкових клітин може затягнутися, 
то рекомендується спочатку випробувати завдання на полі розміром 6х6). 
У програмі необхідно використовувати рекурсію.

4. Написати гру «П'ятнашки».

5. Написати гру «Хрестики-нулики». */
#include "Vubir_zadachu.h"
#include "Zadacha3.h"

int main() {
	/*int a;
	Random();
	Zadachu();
	Vvod(a);
	if (a == 6)return 0;
	Show('\n');
	Switch_zadachu(a);
	Show('\n');
	a = main();*/
	//Show('\n');
	main2();
}