/*3. Дана шахівниця розміром 8х8 і шаховий кінь. 
Програма має вимагати від користувача координати клітини поля й поставити туди коня. 
Завдання програми знайти і вивести шлях коня, при якому він обійде всі клітини дошки, 
стаючи в кожну клітину тільки один раз.
(Оскільки процес пошуку шляху для різних початкових клітин може затягнутися, 
то рекомендується спочатку випробувати завдання на полі розміром 6х6). 
У програмі необхідно використовувати рекурсію.*/
#pragma once
#include "Zagalne.h"
//#include "stdafx.h"
#include <stdio.h>
#define move_types 8

void main2();