/*2.
a) Напишіть рекурсивну функцію, яка приймає двовимірний масив цілих чисел і 
кількість зрушень і виконує круговий зсув масиву вправо.
Наприклад:
Дан масив:
4 5 6 7
1 2 4 1
4 5 6 9
Зрушуємо на три вправо:
5 6 7 4
2 4 1 1
5 6 9 4

b) Напишіть рекурсивну функцію, яка приймає двовимірний масив цілих чисел і 
кількість зрушень і виконує круговий зсув масиву вліво.
Наприклад
Дан масив:
4 5 6 7
1 2 4 1
4 5 6 9
Зрушуємо на два вліво:
6 7 4 5
4 1 1 2
6 9 4 5

c) Напишіть рекурсивну функцію, яка приймає двовимірний масив цілих чисел і 
кількість зрушень і виконує круговий зсув масиву вниз.
Наприклад:
Дан масив:
4 5 6 7
1 2 4 1
4 3 6 8
Зрушуємо вниз на один:
4 3 6 8
4 5 6 7
1 2 4 1
*/
#pragma once
#include "Zagalne.h"
void Zsuv_masuvy();
int Zsuv(int N);
void Zsyv_Vpravo(int c, int i, int Ar[][7], int row, int col);
void Zsyv_Vlivo(int c, int i, int Ar[][7], int row, int col);
void Zsyv_Vnuz(int c, int i, int Ar[][7], int row, int col);